/* Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.
Например, задан массив:

1 4 7 2
5 9 2 3
8 4 2 4
5 2 6 7

Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка*/

//============================================================================================================
// Введём две переменных и сделаем условие на равенство

int rows = 4;
int cols = 2;
if(rows ==cols) // проверка на неравенство
{
    Console.WriteLine("Матрица не прямоугольная");
    return;
}
// 1. Заполним таблицу.
// Создадим пустую матрицу
int[,] rezultMatrix = GetMatrix(rows,cols,0,10);
/// <summary>
/// Этот метод заполняет двумерный массив
/// числами от min до max (общее описание)
/// </summary>
/// <param name="rows">Количество строк</param>
/// <param name="cols">Количество столбцов</param>
/// <param name="min">Минимальное число для рандома</param>
/// <param name="max">Максимальное число для рандома</param>
/// <returns>Заполненнвй двумерный массив целых чисел</returns>
int[,] GetMatrix(int rows, int cols, int min, int max)
{
    // Чтобы создать двумерный массив мы создаём некую матрицу
    int[,] matrix = new int[rows, cols];    
    for (int i = 0; i < rows; i++)
    {
        for (int j = 0; j < cols; j++)
        {
            matrix[i, j] = new Random().Next(min, max + 1);
        }
    }
    return matrix;
}
//===========================================================
/// <summary>
/// Метод печатает матрицу, переданную на вход
/// </summary>
/// <param name="inputMatrix"> Входная матрица</param>
void PrintMatrix(int[,] inputMatrix)
{
    for (int i = 0; i < inputMatrix.GetLength(0);i ++)
    {
            for (int j = 0; j < inputMatrix.GetLength(1);j ++)
        {
            Console.Write(inputMatrix[i, j] + "\t");
        }
        Console.WriteLine();
    }
}
// 2. Печать матрицы
PrintMatrix(rezultMatrix);
//===========================================================

 
// пишем МЕТОД нахождения суммы строчки в любом массиве 

/// <summary>
///  МЕТОД нахождения суммы строчки в любом массиве 
/// </summary>
/// <param name="array">любой двумерный массив</param>
/// <param name="i">изменяющийся параметр строки</param>
/// <returns>сумма в строке</returns>
int SumRows(int[,] array, int i)
{
    int sum = array[i, 0]; // назначим переменной sum значение итой строчки 1 столбца
  
    for (int j = 1; j < array.GetLength(1); j++)  // идём только по стлбцам
    {
        sum = sum + array[i, j];  // складируем всё в переменную sum
    }
    return sum;
}

//==============================================================

int sum = SumRows(rezultMatrix, 0);  // назначим переменную sum , куда положим результат
                                    // суммы вычисленной по методу SumRows у нашей матрицы 1 строки

Console.WriteLine($"Добытая сумма первой строчки: {sum}");

//==============================================================

int minSum = 0;  // номер строки пока 0

for (int i = 0; i < rezultMatrix.GetLength(0); i++) // в цикле проходящем по нашей матрице
{
    if (sum > SumRows(rezultMatrix, i))  // если сумма первой строки больше, 
         // чем сумма вычисленная по методу SumRows у нашей матрицы итой строки

    {
        sum = SumRows(rezultMatrix, i); // находим наименьшую и фиксируем её индекс

        minSum = i + 1; // индекс + единица это номер нашей строки
    }
}
Console.WriteLine($" наименьшей суммой элементов: {sum}");
Console.WriteLine($"Строка c наименьшей суммой элементов: {minSum}");